Repository: radmorecameron/CTP
Catalog: CodeTestingPlatform/CodeTestingPlatform/Resources/Views/Home/Help.*.resx
Languages: fr

# CodeSubmission
source: CodeSubmission Page
fr: Page de soumission de code

# CodeSubmissionMessage
source: After you select an activity, you will be taken to the Code Submission page. In here, you can upload your file, view all methods for an activity, select and run tests, and see the results.
fr: Après avoir sélectionné une activité, vous serez redirigé vers la page de soumission de code. Ici, vous pouvez télécharger votre fichier, afficher toutes les méthodes d'une activité, sélectionner et exécuter des tests et voir les résultats.

# CodeUpload
source: Upload a Source File
fr: Télécharger un fichier source

# CodeUploadMessage
source: You can upload a file. Click on Browse to select a file. Once you choose a file, click on the Upload File button.
fr: Vous pouvez télécharger un fichier. Cliquez sur Parcourir pour sélectionner un fichier. Une fois que vous avez choisi un fichier, cliquez sur le bouton Télécharger le fichier.

# CreateActivities
source: Creating Activities
fr: Créer des activités

# CreateActivitiesMessage
source: Through the 'create' activity menu, you have a choice of activity type (Assignment, Exercise or Lab), activity language as well as an activity's start and end date.
fr: Grâce au menu d’activité « Créer », vous avez le choix entre le type d’activité (Devoir, Exercice ou Laboratoire), la langue de l’activité ainsi que la date de début et de fin d’une activité.

# CreateMethodSignatures
source: Creating Method Signatures
fr: Création de signatures de méthode

# CreateMethodSignaturesMessage
source: When creating a method signature, you are able to specify the return type, the name of the method, the description of the method and you are able to add parameters to the method signature.
fr: Lors de la création d'une signature de méthode, vous pouvez spécifier le type de retour, le nom de la méthode, la description de la méthode et vous pouvez ajouter des paramètres à la signature de la méthode.

# CreateTestCase
source: Creating Test Cases
fr: Créer des scénarios de test

# CreateTestCaseMessage
source: When creating a test case, you are able to specify the name of the test case, the expected result of the test case as well as specify the values for all of the parameters.
fr: Lors de la création d'un scénario de test, vous pouvez spécifier le nom du scénario de test, le résultat attendu du scénario de test ainsi que spécifier les valeurs de tous les paramètres.

# ExpandActivities
source: Expanding Activities
fr: Expansion des activités

# ExpandActivitiesMessage
source: You are able to expand activities in order to view the Method Signatures and Test Cases that are part of the activity by clicking the arrow on the left side of the table.
fr: Vous pouvez développer des activités afin d’afficher les signatures de méthode et les cas de test qui font partie de l’activité en cliquant sur la flèche sur le côté gauche du tableau.

source: Help
fr: Aide

source: Language
fr: Langue

source: Logging In
fr: Connexion

# LoginMessage
source: The first page that you see is the login page. On this page you will enter you Heritage Credentials in order to access the system.
fr: La première page que vous voyez est la page de connexion. Sur cette page, vous entrerez vos informations d’identification patrimoniales afin d’accéder au système.

# Methods
source: Method Signatures
fr: Signatures de méthode

# MethodsMessage
source: In the methods tab, you can get a list of method signatures for the selected activity. Click on the method to get detailed information like the name of the method, the return type, and parameter names and types.
fr: Dans l'onglet méthodes, vous pouvez obtenir une liste des signatures de méthode pour l'activité sélectionnée. Cliquez sur la méthode pour obtenir des informations détaillées telles que le nom de la méthode, le type de retour et les noms et types de paramètres.

source: Select Tests
fr: Sélectionnez les tests

# SelectTestsMessage
source: In the Select Tests tab, you can see all the test cases for all methods. You can select which test cases to run. You can select or deselect all tests by clicking on the Select All or Deselect All buttons. Also, you can click on each test case to select or deselect individually. After you select your test cases, you can click on Run Tests to run your tests.
fr: Dans l'onglet Sélectionner les tests, vous pouvez voir tous les cas de test pour toutes les méthodes. Vous pouvez sélectionner les scénarios de test à exécuter. Vous pouvez sélectionner ou désélectionner tous les tests en cliquant sur les boutons Tout sélectionner ou Tout désélectionner. En outre, vous pouvez cliquer sur chaque cas de test pour sélectionner ou désélectionner individuellement. Après avoir sélectionné vos cas de test, vous pouvez cliquer sur Exécuter les tests pour exécuter vos tests.

# StudentActivities
source: List of Available Activities
fr: Liste des activités disponibles

# StudentActivitiesMessage
source: Once you select a course, you get a list of available activities that you can select to test your code. To select an activity, click on the title of the activity.
fr: Une fois que vous avez sélectionné un cours, vous obtenez une liste des activités disponibles que vous pouvez sélectionner pour tester votre code. Pour sélectionner une activité, cliquez sur le titre de l'activité.

# StudentCourseList
source: List of Currently Enrolled Courses
fr: Liste des cours actuellement inscrits

# StudentCourseListMessage
source: After you login, you can see all currently enrolled Computer Science courses for the semester. You can select a course to see if there are available activities for a course.
fr: Une fois connecté, vous pouvez voir tous les cours d'informatique actuellement inscrits pour le semestre. Vous pouvez sélectionner un cours pour voir s'il y a des activités disponibles pour un cours.

source: Test Results
fr: Résultats de test

# TestResultsMessage
source: In the Results tab, you can view all the test results after running your tests. You will see a overview of test results for each method like number of tests passed, and failed. Also, you get the total that ran. In addition, you can get detailed information if you click on the method.
fr: Dans l'onglet Résultats, vous pouvez afficher tous les résultats des tests après avoir exécuté vos tests. Vous verrez un aperçu des résultats des tests pour chaque méthode, comme le nombre de tests réussis et échoués. En outre, vous obtenez le total qui a couru. De plus, vous pouvez obtenir des informations détaillées si vous cliquez sur la méthode.
